# AppendUnitSymbol Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormatValueOptions..::..AppendUnitSymbol Property
FormatValueOptions Class See Also
---
Indicates if a unit symbol should be appended regardless of the settings in the FormatOptions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool AppendUnitSymbol { get; set; }
```

Visual Basic
---
```text
Public Property AppendUnitSymbol As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool AppendUnitSymbol {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True to force a unit symbol to be appended; false to use the settings specified by the FormatOptions. The default is false.
# See Also
FormatValueOptions Class
Autodesk.Revit.DB Namespace